function fib(){ #Початок функції
 
 if [ $1 -le 0 ]; then # Якщо до функції передається аргумент менше або рівний нулю
 echo 0 # то повертаємо 0
 elif [ $1 -eq 1 ]; then # Якщо до функції передається аргумент рівний одиниці
 echo 1 # то повертаємо 1 
 else # в інших випадках повертаємо виконуємо операцію нижче
 echo $[`fib $[$1-2]` + `fib $[$1 - 1]` ] # повертаємо суму рекурсивно викликаних функцій з параметрами N-2 та N-1
 fi # Закриваємо блок перевірки умов
}
for ((i=0; i<=$1; i++));do
	if [ $i -eq 0 ];then
 echo "function is running" # Повідомляємо, що викликано функцію
 fi
 fib $i # Викликаємо рекурсивну функцію

done
